/decl/cultural_info/location/tauwilo
	name = HOME_SYSTEM_SERPENTIDS
	description = "Тау Вило - маленькая планета, родная для ГБС, имеющая низкую гравитацию и плотную кислородную и \
	азотную атмосферу с примесями форона. Здесь преобладают биоразнообразные тропические и субтропические леса.\
	Единственное Человеческое поселение - исследовательский центр, построенный компанией Xynergy и используемый \
	в программе обучения ГБС. Тау-Вило является единственным известным местом размножения этих причудливых \
	созданий."
	distance = "26 световых лет"
