/decl/cultural_info/location/root
	name = HOME_SYSTEM_ROOT
	description = "Рут - самопровозглашенный родной мир Позитронного Союза, - это зеленый мир, медленно движущийся \
	к массовой механизации. Хотя есть позитроники, живущие прямо на поверхности, большинство работают на \
	орбитальных станциях. ИПС, живущие на Руте, как правило, более \"бессердечны\", чем их \"сородичи\" на \
	органических территориях, которые отличаются сильным стремлением к свободе."
	ruling_body = "Ассамблея"
	distance = "55 световых лет"
