/decl/cultural_info/location/moghes
	name = HOME_SYSTEM_MOGHES
	description = "Могес - мертвый мир, полный странных, чудовищных существ и таинственных  ландшафтов, является \
	домом для Унати. Они считают, что этот мир когда-то был пышным и полным жизни, но из-за \
	решения Предтечей, он был разрушен и оставлен гнить. Главная цель всех Унати - возродить \
	былое величие или стать достаточно сильными, чтобы обеспечить себе светлое будущее."
	ruling_body = "Клановый Гегемон"
	distance = "20 световых лет"
	language = LANGUAGE_UNATHI_SINTA //inf
