alf = {
	"й":"é","ц":"ö","у":"ó","к":"ê","е":"å","н":"í","г":"ã","ш":"ø","щ":"ù","з":"ç",
	"х":"õ","ъ":"ú","ф":"ô",'ы':'û','в':'â',"а":"à","п":"ï","р":"ð","о":"î","л":"ë",
	"д":"ä","ж":"æ","э":"ý","я":"ß","ч":"÷","с":"ñ","м":"ì","и":"è","т":"ò","ь":"ü",
	"б":"á","ю":"þ","ё":"å",
	#UPREG
	"Й":"É","Ц":"Ö","У":"Ó","К":"Ê","Е":"Å","Н":"Í","Г":"Ã","Ш":"Ø","Щ":"Ù","З":"Ç",
	"Х":"Õ","Ъ":"Ú","Ф":"Ô",'Ы':'Û','В':'Â',"А":"À","П":"Ï","Р":"Ð","О":"Î","Л":"Ë",
	"Д":"Ä","Ж":"Æ","Э":"Ý","Я":"ß","Ч":"×","С":"Ñ","М":"Ì","И":"È","Т":"Ò","Ь":"Ü",
	"Б":"Á","Ю":"Þ","Ё":"Å",
	#Spec Simbols
	',':',','.':'.','"':'"',"'":"'",
	' ':' ','{':'{','}':'}','[':'[',
	']':']',':':':',';':';','(':'(',
	')':')','_':'_','-':'-','=':'=',
	'+':'+','-':'-','*':'*','&':'&',
	'^':'^','%':'%','$':"$","#":"#",
	"@":"@","!":"!","№":"№","?":"?",
	"`":"`","~":"~","\\":"\\","/":"/",
	"<":"<",">":">",
	#Nums
	'1':"1","2":"2","3":"3",
	"4":"4",'5':'5','6':'6','7':'7',
	'8':'8',"9":"9","0":"0",
	#Eng
	"q":"q","w":"w","e":"e","r":"r",'t':'t','y':'y','u':'u','i':'i',
	'o':'o','p':'p','a':'a','s':'s','d':'d','f':'f','g':'g','h':'h',
	'j':'j','k':'k','l':'l','z':'z','x':'c','v':'v','b':'b','n':'n',
	'm':'m','c':'c',
	#ENG_UP
	"Q":"Q","W":"W","E":"E","R":"R",'T':'T','Y':'Y','U':'U','I':'I',
	'O':'O','P':'P','A':'A','S':'S','D':'D','F':'F','G':'G','H':'H',
	'J':'J','K':'K','L':'L','Z':'Z','X':'C','V':'V','B':'B','N':'N',
	'M':'M','C':'C'
	}
print('Do not use "Ё". Letter "Я" must be in upper register.')
	#й ц у к е н г ш щ з х ъ ф ы в а п р о л д ж э Я ч с м и т ь б ю
	#é ö ó ê å í ã ø ù ç õ ú ô û â à ï ð î ë ä æ ý ß ÷ ñ ì è ò ü á þ
perevod_string = input('Enter: ')
pld = len(perevod_string)
i = 0
newstring = []
srting = ''
itog=[]
while i != pld:
	ch = perevod_string[i]
	newstring = newstring + [ch]
	itog += alf[newstring[i]]
	srting += itog[i]
	i+=1
print('Complete.')
print(srting)
input()