obj/structure/portrait
	name = "Trasen's Portrait"
	desc = "Джек Трейзен - действующий председатель совета директоров. Через эту картину, он всегда осведомлён о каждом проступке и слове экипажа."
	icon = 'infinity/icons/obj/portrait.dmi'
	icon_state = "normal"

obj/structure/portrait/gold
	desc = "Джек Трайзен - великий человек, основатель легендарной мегакорпорации, увековеченный на этом портрете в величественной позе, следящий за каждым неверным поступком и словом экипажа. Рамка на этом произведении исскуства сделана из чистого золота, а стекло в ней было создано из особенно крепкого сплава, который не даст украсть столь желанную многими, фотографию. Похоже, что портрет намертво вмонтирован в стену."
	icon_state = "gold"