/decl/cultural_info/culture/tajaran
	name = CULTURE_TAJARAN
	language = LANGUAGE_SIIK_MAAS
	name_language = LANGUAGE_SIIK_MAAS
	secondary_langs = list(LANGUAGE_SIIK_MAAS, LANGUAGE_SIIK_TAJR)
	description = "“ы - “а€ран рожденный на јдомае. √ордый представитель своего вида. “вои предки ранее долгое врем€ были покорены гр€зными глупцами, считающими свое право властвовать над другими данным им с рождени€ непоколебимым. Ќо пролились реки крови и теперь они мертвы, а ты, как и остальные достойные представители своей расы - свободны. ¬ т€желые времена по€вл€ютс€ сильные личности, и, как тебе хочетс€ верить, ты один из них."