/obj/item/weapon/paper/bar_room
	name = "private room"
	info = "<center><b>NSV Sierra</b></center><center>Приватная комната</center><li>Вы можете попросить у бармена одну из разноцветных лампочек дл&#255; своей комнаты.<li>Доступные цвета: тёмно-фиолетовый, тёмно-розовый, тёмно-красный, синий, зеленый, стандартный.<li><b>Пожалуйста, не ломайте лампочки.</b><li>Бармен может сн&#255;ть блокировку с комнаты в случае необходимости - доступ к внешней кнопки есть только у него, ГП и капитана.<li>Старайтесь не занимать комнату на продолжительное врем&#255; без уведомлени&#255; бармена.<li>Не используйте кабинки дл&#255; сна.<li>Не пачкайте мебель.<hr><i>Наслаждайтесь при&#255;тной компанией.</i>"

/obj/item/weapon/paper/bar_permit
	name = "shotgun permit"
	info = "<center><b>NSV Sierra</b></center><center>Разрешение на ношение оружия</center><hr>Действующий бармен судна имеет право владеть и использовать выданный в начале полета дробовик. Условия:<li>После начала смены, бармен сразу направляется в бар и кладет дробовик в отведенное место.</b><li>Бармен не выносит дробовик за пределы бара.<li>Бармен может использовать только патроны типа illumination (дезориентирующие).<li>При возникновении конфликта в пределах бара, бармен обязан вызвать охрану и попытаться утихомерить конфликтующих словами. Оружие может быть использовано только против 'буйных клиентов'."
